In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from scipy import stats as st
import math as m
import seaborn as sns
import time

In [4]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

In [11]:
df_copy = df.copy()

In [3]:
df.head(5)

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [6]:
df.shape

(1016395, 7)

In [7]:
len(df)

1016395

In [9]:
df.dtypes

Unnamed: 0     int64
Id             int64
Name          object
Year           int64
Gender        object
State         object
Count          int64
dtype: object

In [10]:
df.index

RangeIndex(start=0, stop=1016395, step=1)

# 1. Delete unnamed columns

In [12]:
df = df.drop('Unnamed: 0', 1)

In [13]:
df.head(10)

      Id      Name  Year Gender State  Count
0  11350      Emma  2004      F    AK     62
1  11351   Madison  2004      F    AK     48
2  11352    Hannah  2004      F    AK     46
3  11353     Grace  2004      F    AK     44
4  11354     Emily  2004      F    AK     41
5  11355   Abigail  2004      F    AK     37
6  11356    Olivia  2004      F    AK     33
7  11357  Isabella  2004      F    AK     30
8  11358    Alyssa  2004      F    AK     29
9  11359    Sophia  2004      F    AK     28

In [14]:
df.describe()

                 Id          Year         Count
count  1.016395e+06  1.016395e+06  1.016395e+06
mean   2.830991e+06  2.009053e+03  3.485012e+01
std    1.652476e+06  3.138293e+00  9.739735e+01
min    1.135000e+04  2.004000e+03  5.000000e+00
25%    1.317328e+06  2.006000e+03  7.000000e+00
50%    2.811921e+06  2.009000e+03  1.100000e+01
75%    4.242556e+06  2.012000e+03  2.600000e+01
max    5.647426e+06  2.014000e+03  4.167000e+03

In [15]:
df.columns

Index(['Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

In [16]:
df.isnull().sum()

Id        0
Name      0
Year      0
Gender    0
State     0
Count     0
dtype: int64

# 2. Show the distribution of male and female

In [18]:
df["Gender"].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

# 3. Show the top 5 most preferred names

In [24]:
df["Name"].value_counts().nlargest(5)

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

# 4. What is the median name occurence in the dataset

# 5. Distribution of male and female born count by states

In [35]:
counts = df.groupby(['State','Gender']).sum()

In [36]:
print(counts)

                        Id      Year    Count
State Gender
AK    F           30173806   4829869    26250
      M           65632190   5197843    37399
AL    F          890822735  19845311   215308
      M         1256518912  16914313   260114
AR    F         1446562804  14406855   129712
      M         1595809075  13008772   162947
AZ    F         4391847439  29165718   368567
      M         3793573150  21737902   439691
CA    F        24509016180  90692449  2414063
      M        21969112444  63560331  2670584
CO    F         8682268560  22951166   260805
      M         7393361862  18449560   313425
CT    F         5586816950  13208966   141350
      M         5066601813  11517780   171397
DC    F         2788237734   6133657    35276
      M         2815366500   6026894    47228
DE    F         2434453038   5120947    31312
      M         2364746740   4902175    41748
FL    F        27430623066  51794371   915422
      M        23038563735  40322026  1060957
GA    F        24057133930  38943789   549637
      M        20386939981  31047180   635531
HI    F         4403998725   6539042    37279
      M         4883638077   7124211    53127
IA    F        10156854444  14326801   144764
      M         9233290325  12671794   174009
ID    F         7342414165   9880236    72808
      M         7340558553   9709904    94320
IL    F        34754283382  42726564   695312
      M        29069570670  33807662   791679
...                    ...       ...      ...
OK    F        39090468387  19124248   184967
      M        33824404783  16350421   228613
OR    F        36152799138  17285853   172111
      M        31083985694  14732765   209445
PA    F        75881178180  35118286   593382
      M        62653023594  28471228   682709
RI    F        11379647979   5138678    35560
      M        11020588690   4958185    47939
SC    F        42794511495  19015720   197917
      M        37479250655  16464191   237442
SD    F        13054023807   5701738    34104
      M        13438105002   5842648    45443
TN    F        61241799844  26244829   336487
      M        50269574050  21272886   398615
TX    F       195538666120  79880914  1786281
      M       140714698329  55835536  2005394
UT    F        48691566220  19115922   202892
      M        42446614644  16541112   245324
VA    F        77146960767  29651473   405503
      M        63468952794  24102997   466873
VT    F         7423983237   2808400    15079
      M         8613140659   3250553    21353
WA    F        71737850952  26779452   334944
      M        60027559650  22199421   395377
WI    F        57950193070  21193698   264921
      M        49547746290  17961579   311758
WV    F        24043842585   8648978    73800
      M        20974405518   7500087    93557
WY    F         8202225304   2925067    14107
      M        10750887448   3825225    21912

[102 rows x 3 columns]